{
  "sections": {
    "aboutMe": "About Me",
    "technicalSkills": "Technical Skills",
    "softSkills": "Soft Skills",
    "educationSection": "Education",
    "workExperience": "Work Experience",
    "languageSection": "Languages",
    "conferencesSection": "Conferences & Trainings",
    "additionalInfo": "Additional Information",
    "otherProjects": "Other Projects"
  },
  
  "header": {
    "name": "Piotr Falkowski",
    "title": "Senior Backend Software Developer with over 10 years of experience."
  },

  "about": {
    "firstParagraph": "Driven, passionate, problem solver. I taught myself C++ to analyze financial time series using ML. Then it snowballed into .NET and countless other technologies. I’ve seen a lot, maybe even too much sometimes. I drew conclusions and now I focus on radical simplicity to ensure quality and maintainability.",
    "secondParagraph": "Beyond my full-time work, I actively develop the ML stock market prediction app. I'm also involved in the development and shape of Squizzu.com, an AI driven tech quiz platform."
  },

  "consent": "I hereby agree for processing the following personal information for the purposes of recruitment processes only.",
  

  "softSkills": {
    "list": ["Integrity", "Persistence", "Autonomy", "Creativity", "Deep Focus"]
  },

  "education": {
    "highSchool": {
      "name": "Polish/French Bilingual High School",
      "period": "2004 - 2008"
    },
    "university": {
      "name": "Jagiellonian University - Psychology - Master",
      "period": "2009 - 2016"
    }
  },

  "workExperience": {
    "igexao": {
      "title": "IGE+XAO - Intern",
      "year": "2014",
      "description": "Implemented database wide undo T-SQL procedure ahead of schedule using c# code generator based on table schema. Maintained C++ CAD desktop app."
    },
    "transactor": {
      "title": "Transactor Poland - Junior Software Developer",
      "period": "2014 - 2017",
      "description": "Started as a Junior Software Developer and was promoted to Regular after successfully delivering the first project — a WPF business intelligence application that aggregated data from multiple APIs, providing significant value to the customer at a low cost. C#, WPF, XSLT, XSD, SQLite, Ms SQL. Developed, refactored, bug fixed, and unit tested an end-to-end insurance lifetime management system. Participated in multiple third-party integrations, including payment providers and data enrichment services, ensuring interoperability between systems. T-SQL, WCF, ASP.NET API, WPF, Windows Forms, VB.NET, MS SQL, WWF, SignalR, SOAP, AzureDevops (VSTS at the time), Trello, Jira and Zendesk."
    },
    "opengi": {
      "title": "Open GI - Software Developer",
      "period": "2017 - 2019",
      "description": "Took part in modernizing legacy desktop monolith by splitting and migrating logic into microservices while heavily unit-testing existing functionality and moving slowly by first hosting the old Windows Application over Azure Virtual Desktop. Used ASP.NET Core, WCF, RabbitMQ, WWF, Azure IaaS, MongoDB, MS SQL, SonarQube, Docker."
    },
    "ju": {
      "title": "Jagiellonian University - Researcher",
      "period": "2019 - 2020",
      "description": "I developed electroencephalogram (EEG) monkey brain activity classifier and an Arduino-based tactile stimulator. The stimulator features 2 gloves with 5 efectors, each controllable separately via COM and  [source](https://github.com/PFalkowski/HapticStimulatorPCA9685). For classification I used Python's Keras achieving accuracy above 0.8 after applying FFT and other transformations to raw EEG time series [source](https://github.com/PFalkowski/KerasClassifierEeg)."
    },
    "smh": {
      "title": "Seville More Helory Polska - Senior Software Developer",
      "period": "since 2020",
      "description": "Implemented, documented and unit tested GIT inspired document version control in C# ASP.NET / CosmosDb / Azure AI (Cognitive) Search + Azure Service Bus + Redis + SignalR + SonarCloud. /n Cut Azure Redis Cache costs by implementing an intermediate cache layer based on CosmosDb./nDesigned and implemented the backend for a bespoke process that secured a key client, increasing company revenue by over 10%. C# Web.API + CosmosDb + React."
    }
  },

  "languages": {
    "polish": "Polish - Native",
    "english": "English - C2",
    "french": "French - B2"
  },

  "conferences": {
    "list": [
      "2014 - Scrum Workshop",
      "2018 - .NET DeveloperDays",
      "2019 - MEGA Sekurak Hacking Party",
      "2020 - AzureDay",
      "2021 - MEGA Sekurak Hacking Party",
      "2025 - Niebezpiecznik - Attacking and Securing Web Apps"
    ]
  },

  "additionalInfo": {
    "drivingLicense": "Category B driving license.",
    "psychology": "Knowledge in psychology.",
    "hobbies": "Hobbies: economics (personal finance and quantitative analysis), board games, running, bodybuilding."
  },

  "otherProjects": {
    "stockinsight": "Stock market analysis tool [Stockinsight](https://stockinsight.pl). Hosting: Azure, BE: C# MsSQL ML.NET, FE: pure HTML + CSS + JS.",
    "squizzu": "I am CTO of [Squizzu](https://squizzu.com), a tech quiz platform being built in React and C#.",
    "otherVentures": "Throughout my journey, I have also explored other startup ventures like an online course platform, and a calendar tool built with PowerApps. While these projects didn't achieve long-term success, they provided valuable lessons and skills like proficiency in PowerPlatform.",
    "nugetIntro": "Notable NuGet packages I maintain:",
    "nugetPackages": {
      "loggerLite": "A lightweight logging framework supporting JSON, XML, YAML, and console output, with built-in debouncing.",
      "onTheFlyStats": "Allows on-the-fly computation of statistics such as means and variance allowing O(1) access.",
      "extensionsStandard": "A collection of extension methods for common programming tasks such as interpolation and partitioning.",
      "progressReporting": "A library for estimating completion time and reporting progress in iterative operations and data transfers."
    },
    "nugetFooter": "These and other packages are available on [NuGet.org](https://www.nuget.org/profiles/PFalkowski).",
    "githubActivity": "My GitHub activity"
  }
}