{
  "sections": {
    "aboutMe": "About Me",
    "technicalSkills": "Technical Skills",
    "softSkills": "Soft Skills",
    "educationSection": "Education",
    "workExperience": "Work Experience",
    "languageSection": "Languages",
    "conferencesSection": "Conferences & Trainings",
    "additionalInfo": "Additional Information",
    "otherProjects": "Other Projects"
  },
  
  "header": {
    "name": "Piotr Falkowski",
    "title": "Senior Backend Software Developer with 10+ years of experience."
  },

  "about": {
    "firstParagraph": "I'm focused on quality and proponent of radical simplicity.",
    "secondParagraph": "I have 10+ years to back my expertise and a team-player and problem solver attitude to quickly get the things going."
  },

  "consent": "I hereby agree for processing the following personal information for the purposes of recruitment processes only.",
  

  "softSkills": {
    "list": ["Integrity", "Persistence", "Autonomy", "Creativity", "Deep Focus"]
  },

  "education": {
    "highSchool": {
      "name": "Polish/French Bilingual High School",
      "period": "2004 - 2008"
    },
    "university": {
      "name": "Jagiellonian University - Psychology - Master",
      "period": "2009 - 2016"
    }
  },

  "workExperience": {
    "igexao": {
      "title": "IGE+XAO - Intern",
      "year": "2014",
      "description": "Implemented database wide undo in T-SQL."
    },
    "transactor": {
      "title": "Transactor Poland - Junior Software Developer",
      "period": "2014 - 2017",
      "description": "Developed WPF business intelligence application, then worked in an agile team on an end-to-end policy lifecycle management system, handling development, refactoring, bug fixing, and unit testing. Technologies: T-SQL, WCF, ASP.NET APIs, WPF, Windows Forms, XSLT, XML, SOAP, HTML, CSS, TeamCity, XSD, VB.NET, and SQLite. Throughout this role, I gained experience in a wide range of technologies like performance and SQL profiling, WCF, WWF (Windows Workflow Foundation), XSLTs, SOAP and many more. For project management and collaboration I used AzureDevops (VSTS at the time), Trello, Jira and Zendesk."
    },
    "opengi": {
      "title": "Open GI - Software Developer",
      "period": "2017 - 2019",
      "description": "Continuation of previous employment under different brand. More focus on newer technologies, we used ASP.NET Core over WCF, RabbitMQ instead of WWF, more Azure over on premise, MongoDB over MS SQL. A significant challenge was modernizing legacy VB6 application, which we successfully achieved by splitting and migrating logic into WPF-based microservices while heavily unit-testing existing functionality and moving slowly by first hosting the old Windows Application over Azure Virtual Desktop and then, when all the services were stable and tested we connected a modern frontend."
    },
    "ju": {
      "title": "Jagiellonian University - Researcher",
      "period": "2019 - 2020",
      "description": "I developed electroencephalogram (EEG) monkey brain activity classifier and an Arduino-based tactile stimulator. The stimulator features 2 gloves with 5 efectors, each controllable separately via COM and  [source](https://github.com/PFalkowski/HapticStimulatorPCA9685). For classification I used Python's Keras achieving accuracy above 0.8 after applying FFT and other transformations to raw EEG time series [source](https://github.com/PFalkowski/KerasClassifierEeg)."
    },
    "smh": {
      "title": "Seville More Helory Polska - Senior Software Developer",
      "period": "since 2020",
      "description": "My main responsibility was implementing the document version control in C# ASP.NET API, developing solutions using Azure AI (Cognitive) Search, Azure Service Bus and Redis Cache, improving performance and implementing custom optimizations like intermediate cache layer on CosmosDb. Later, I was trusted with code architecture and implementation of a bespoke process for a new key client - I made correct key design choices early on with limited scope of requirements as well as decided on priorities to ensure smooth front-end and backend interoperability. My data architecture ensured flexibility, allowing us to adapt seamlessly as the project evolved, ensuring models remain adaptable to changing requirements while remaining efficient."
    }
  },

  "languages": {
    "polish": "Polish - Native",
    "english": "English - C2",
    "french": "French - B2"
  },

  "conferences": {
    "list": [
      "2014 - Scrum Workshop",
      "2018 - .NET DeveloperDays",
      "2019 - MEGA Sekurak Hacking Party",
      "2020 - AzureDay",
      "2021 - MEGA Sekurak Hacking Party",
      "2025 - Niebezpiecznik - Attacking and Securing Web Apps"
    ]
  },

  "additionalInfo": {
    "drivingLicense": "Category B driving license.",
    "psychology": "Knowledge in psychology.",
    "hobbies": "Hobbies: economics (personal finance and quantitative analysis), board games, running, bodybuilding."
  },

  "otherProjects": {
    "stockinsight": "Stock market analysis tool [Stockinsight](https://stockinsight.pl). Hosting: Azure, BE: C# MsSQL ML.NET, FE: pure HTML + CSS + JS.",
    "squizzu": "I am CTO of [Squizzu](https://squizzu.com), a tech quiz platform being built in React and C#.",
    "otherVentures": "Throughout my journey, I have also explored other startup ventures like an online course platform, and a calendar tool built with PowerApps. While these projects didn't achieve long-term success, they provided valuable lessons and skills like proficiency in PowerPlatform.",
    "nugetIntro": "Notable NuGet packages I maintain:",
    "nugetPackages": {
      "loggerLite": "A lightweight logging framework supporting JSON, XML, YAML, and console output, with built-in debouncing.",
      "onTheFlyStats": "Allows on-the-fly computation of statistics such as means and variance allowing O(1) access.",
      "extensionsStandard": "A collection of extension methods for common programming tasks such as interpolation and partitioning.",
      "progressReporting": "A library for estimating completion time and reporting progress in iterative operations and data transfers."
    },
    "nugetFooter": "These and other packages are available on [NuGet.org](https://www.nuget.org/profiles/PFalkowski).",
    "githubActivity": "My GitHub activity"
  }
}