{
  "sections": {
    "aboutMe": "O mnie",
    "technicalSkills": "Umiejętności techniczne",
    "softSkills": "Umiejętności miękkie",
    "educationSection": "Wykształcenie",
    "workExperience": "Doświadczenie zawodowe",
    "languageSection": "Języki",
    "conferencesSection": "Konferencje i szkolenia",
    "additionalInfo": "Dodatkowe informacje",
    "otherProjects": "Własne projekty"
  },

  "header": {
    "name": "Piotr Falkowski",
    "title": "Programista z 10-letnim doświadczeniem."
  },

  "about": {
    "firstParagraph": "Mam ponad 10 lat zawodowego doświadczenia w rozwoju i utzymaniu aplikacji biznesowych, głównie w .NET.",
    "secondParagraph": "Poza pracą, aktywnie rozwijam zautomatyzowane narzędzie do analizy giełdowej [Stockinsight](https://stockinsight.pl), pełnię funkcję CTO platformy quizowej o tematyce technicznej [Squizzu](https://squizzu.com) oraz utrzymuję wiele bibliotek open-source."
  },

  "softSkills": {
    "list": ["Uczciwość", "Wytrwałość", "Autonomia", "Kreatywność", "Skupienie"]
  },

  "education": {
    "highSchool": {
      "name": "XVII Liceum Ogólnokształcące im. Młodej Polski",
      "period": "2004 - 2008"
    },
    "university": {
      "name": "Uniwersytet Jagielloński - Psychologia - Magister",
      "period": "2009 - 2016"
    }
  },

  "workExperience": {
    "igexao": {
      "title": "IGE+XAO - Stażysta",
      "year": "2014",
      "description": "Poza refaktoryzacją i naprwą błędów w C++, implementowałem operację UNDO na bazie z uzyciem procedury T-SQL, którą wcześniej wygenerowałem w C# na bazie schematu tabel. "
    },
    "transactor": {
      "title": "Transactor Poland - (Junior) Software Developer",
      "period": "2014 - 2017",
      "description": "Rozpocząłem pracę jako młodszy programista a po pozytywnym odbiorze przez klienta projektu, który implementowałem — aplikacji business intelligence w WPF agregującej dane z wielu API, zostałem awansowany. Następnie pracowałem w jednym z zespołów w trybie metodyk zwinnych nad systemem zarządzania cyklem życia polisy ubezpieczeniowej, zajmując się rozwojem, refaktoryzacją, naprawą błędów i testami jednostkowymi. Główne technologie, w których pracowałem to T-SQL, WCF, ASP.NET API, WPF, Windows Forms, XSLT, XSD, VB.NET i SQLite. Uczestniczyłem w wielu integracjach z systemami zewnętrznymi, w tym dostawcami płatności i usługami wzbogacania danych."
    },
    "opengi": {
      "title": "Open GI - Software Developer",
      "period": "2017 - 2019",
      "description": "Kontynuacja poprzedniego zatrudnienia pod inną marką. Większy nacisk na nowsze technologie; WCF zastępowaliśmy ASP.NET Core, używaliśmy RabbitMQ zamiast WWF, Azure Cloud zamiast on-premise, MongoDB zamiast MS SQL. Znaczącym wyzwaniem była modernizacja zastanej aplikacji napisanej w VB6, co osiągnęliśmy poprzez podział i migrację do mikroserwisów, jednocześnie intensywnie testując istniejącą funkcjonalność przechodząc powoli przez hosting na VMce przez Azure Virtual Desktop, a następnie, gdy wszystkie usługi były stabilne i przetestowane, podłączyliśmy nowoczesny frontend."
    },
    "ju": {
      "title": "Uniwersytet Jagielloński - Badacz",
      "period": "2019 - 2020",
      "description": "Uczestniczyłem w badaniu finansowanym z grantu, gdzie opracowałem klasyfikator aktywności EEG mózgu małp oraz stymulator dotykowy kontrolowany Arduino. Stymulator składa się z 2 rękawic, każda z 5 osobno kontrolowalnymi efektorami [źródło](https://github.com/PFalkowski/HapticStimulatorPCA9685). Klasyfikacja szeregów czasowych EEG po zastosowaniu FFT i innych transformacji miała dokładność powyżej 0.8 [źródło](https://github.com/PFalkowski/KerasClassifierEeg)."
    },
    "smh": {
      "title": "Seville More Helory Polska - Senior Software Developer",
      "period": "od 2020",
      "description": "Dołączyłem do projektu implementującego wersjonowanie dokumentów. Moją główną odpowiedzialnością była implementacja funkcjonalności w C# Web.API oraz z czasem integracja z Azure AI (Cognitive) Search, Service Bus i Redis Cache, implementacja niestandardowej warstwy cache w oparciu o CosmosDb i poprawa wydajności wielu procesów. Po zakończeniu projektu powierzono mi planowanie i implementację architektury procesu dla nowego kluczowego klienta. Podejmowałem kluczowe decyzje projektowe na wczesnym etapie bez pełnego zakresu wymagań oraz decydowałem o priorytetach, zapewniając płynną pracę front-endu i backendu. W tym czasie napisałem niezliczoną ilość migracji bazy danych w CosmosDb, doskonaląc swoją wiedzę ale i wyczucie do projektowania encji, które będą łatwo adaptowalne do zmieniających się wymagań, pozostając jednocześnie wydajne i łatwe do migracji. Poza rozwojem systemu, odegrałem kluczową rolę w zapobieganiu błędnym decyzjom technicznym, np. gdy kierownictwo naciskało na nadmierne enkodowanie, zbadałem źródło problemu i rozwiązałem go usuwając kod zamiast dodawać, unikając przykrycia problemu nowymi."
    }
  },

  "languages": {
    "polish": "Polski - Ojczysty",
    "english": "Angielski - C2",
    "french": "Francuski - B2"
  },

  "conferences": {
    "list": [
      "Warsztaty Scrum - 2014",
      ".NET DeveloperDays 2018",
      "MEGA Sekurak Hacking Party 2019",
      "AzureDay 2020",
      "MEGA Sekurak Hacking Party 2020"
    ]
  },

  "additionalInfo": {
    "drivingLicense": "Prawo jazdy kategorii B.",
    "psychology": "Szeroka wiedza z zakresu psychologii.",
    "hobbies": "Zainteresowania: ekonomia (finanse osobiste i analiza ilościowa), gry planszowe, bieganie, siłownia."
  },

  "otherProjects": {
    "stockinsight": "Aktywnie rozwijam narzędzie do analizy serii czasowych w postaci cen akcji polskich i zagranicznych spółek z użyciem algorytmów uczenia maszynowego, statystycznych, analizie technicznej i fundamentalnej. Backend, napisany w C# odpowiada za synchronizację danych, wykonywanie analizy, generowanie raportów i przesyłanie wyników do repozytorium, gdzie GitHub Action uruchamia wdrożenie statycznej strony internetowej do Azure, dając zerowy koszt utrzymania. Strona z aktualnymi wynikami analiz [Stockinsight](https://stockinsight.pl).",
    "squizzu": "Pełnię funkcję CTO w [Squizzu](https://squizzu.com), platformie quizowej zbudowanej w React / C#. Zaprojektowałem większość modelu danych, zaimplementowałem większość z nich, skonfigurowałem CosmosDB, KeyVault na Azure i zintegrowałem z nimi.",
    "otherVentures": "W trakcie mojej podróży eksplorowałem również inne przedsięwzięcia startupowe, w tym Drwal.it, platformę kursów online i narzędzie kalendarzowe zbudowane z PowerApps. Chociaż te projekty nie osiągnęły długoterminowego sukcesu, dostarczyły cennych lekcji i umiejętności, takich jak biegłość w PowerPlatform.",
    "nugetIntro": "Oto kilka popularniejszych bibliotek które rozwijam i utrzymuję:",
    "nugetPackages": {
      "loggerLite": "Lekki framework do logowania, obsługujący JSON, XML, YAML, konsolę, pliki itd. z wbudowanym debouncingiem.",
      "onTheFlyStats": "Umożliwia obliczanie statystyk w locie, takich jak średnie, wariancja zapewniając dostęp w czasie O(1).",
      "extensionsStandard": "Kolekcja metod rozszerzających dla typowych zadań programistycznych, takich jak interpolacja, partycjonowanie itp.",
      "progressReporting": "Biblioteka do szacowania pozostałego czasu i raportowania postępu pętli lub transferu danych."
    },
    "nugetFooter": "Te i inne pakiety są dostępne na [NuGet.org](https://www.nuget.org/profiles/PFalkowski).",
    "githubActivity": "Moja aktywność na GitHub"
  },

  "consent": "Wyrażam zgodę na przetwarzanie moich danych osobowych wyłącznie do celów rekrutacji."
}